Q1: Drop rows where EmployeeName and JobTitle are 'Not provided'

In [16]:
import pandas as pd

df = pd.read_csv('Salaries - Salaries.csv', low_memory=False)
df = df.query("EmployeeName != 'Not provided' or JobTitle != 'Not provided'")

print(df.head())

   Id       EmployeeName                                        JobTitle  \
0   1     NATHANIEL FORD  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1   2       GARY JIMENEZ                 CAPTAIN III (POLICE DEPARTMENT)
2   3     ALBERT PARDINI                 CAPTAIN III (POLICE DEPARTMENT)
3   4  CHRISTOPHER CHONG            WIRE ROPE CABLE MAINTENANCE MECHANIC
4   5    PATRICK GARDNER    DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)

     BasePay OvertimePay   OtherPay Benefits   TotalPay  TotalPayBenefits  \
0  167411.18           0  400184.25      NaN  567595.43         567595.43
1  155966.02   245131.88  137811.38      NaN  538909.28         538909.28
2  212739.13   106088.18    16452.6      NaN  335279.91         335279.91
3      77916    56120.71   198306.9      NaN  332343.61         332343.61
4   134401.6        9737  182234.59      NaN  326373.19         326373.19

   Year  Notes         Agency Status
0  2011    NaN  San Francisco    NaN
1  2011    NaN  San Francisco    NaN
2  2011    NaN  San Francisco    NaN
3  2011    NaN  San Francisco    NaN
4  2011    NaN  San Francisco    NaN

Q2: Replace 'Not Provided' with 0 in BasePay OvertimePay	OtherPay	Benefits

In [18]:
import pandas as pd
df = pd.read_csv('Salaries - Salaries.csv', low_memory=False)
df.replace('Not Provided', 0, inplace=True)
print(df[['BasePay', 'OvertimePay', 'OtherPay', 'Benefits']].head())

     BasePay OvertimePay   OtherPay Benefits
0  167411.18           0  400184.25      NaN
1  155966.02   245131.88  137811.38      NaN
2  212739.13   106088.18    16452.6      NaN
3      77916    56120.71   198306.9      NaN
4   134401.6        9737  182234.59      NaN

Q3:Change BasePay	OvertimePay	OtherPay	Benefits type to float

In [20]:
import pandas as pd
df = pd.read_csv('Salaries - Salaries.csv', low_memory=False)

df[['BasePay','OvertimePay','OtherPay','Benefits']] = df[['BasePay','OvertimePay','OtherPay','Benefits']].replace('Not Provided', 0).astype(float)

df[['BasePay','OvertimePay','OtherPay','Benefits']].dtypes

BasePay        float64
OvertimePay    float64
OtherPay       float64
Benefits       float64
dtype: object

Q 4: Display all employees name and basepay columns who have a BasePay greater than 200,000.

In [22]:
import pandas as pd
df = pd.read_csv('Salaries - Salaries.csv', low_memory=False)

df['BasePay'] = df['BasePay'].replace('Not Provided', 0).astype(float)
df[df['BasePay'] > 200000][['EmployeeName', 'BasePay']]

              EmployeeName    BasePay
2           ALBERT PARDINI  212739.13
7            DAVID KUSHNER  256576.96
9       JOANNE HAYES-WHITE  285262.00
12       EDWARD HARRINGTON  294580.02
13             JOHN MARTIN  271329.03
...                    ...        ...
110953      Ronald P Flynn  201296.01
110954    Sheryl L Bregman  201296.00
110976       Susan T Obata  202445.22
110977       John O Funghi  201181.01
111107       Mayra T Vivas  205036.00

[509 rows x 2 columns]

Q5: Find all employees whose JobTitle contains the word “Manager” (case = False)

In [23]:
import pandas as pd
df = pd.read_csv('Salaries - Salaries.csv', low_memory=False)

df[df['JobTitle'].str.contains('Manager', case=False)][['EmployeeName', 'JobTitle']]

                EmployeeName                                        JobTitle
0             NATHANIEL FORD  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
83            EDWARD REISKIN  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
87               KEVIN BARRY                                     MANAGER VII
95              MIVIC HIROSE                                    MANAGER VIII
162            JULIE LABONTE                                    MANAGER VIII
...                      ...                                             ...
147216  Steven D Koneffklatt                                     Manager III
147502    Alice B Villagomez                                      Manager IV
147805    Stephen C Laplante                                      Manager II
148150      Shirley M Parker                           Real Property Manager
148475         James P Horan                                      Manager IV

[4110 rows x 2 columns]

Q6: Retrieve only the columns: EmployeeName, JobTitle, and TotalPay.

In [24]:
import pandas as pd
df = pd.read_csv('Salaries - Salaries.csv', low_memory=False)

df[['EmployeeName', 'JobTitle', 'TotalPay']]

,EmployeeName,JobTitle,TotalPay
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,567595.43
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),538909.28
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),335279.91
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,332343.61
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",326373.19
...,...,...,...
148649,Roy I Tillery,Custodian,0.00
148650,Not provided,Not provided,0.00
148651,Not provided,Not provided,0.00
148652,Not provided,Not provided,0.00
148653,Joe Lopez,"Counselor, Log Cabin Ranch",-618.13

Q7: Find count of employees who have zero OvertimePay.

In [26]:
import pandas as pd
df = pd.read_csv('Salaries - Salaries.csv', low_memory=False)

df['OvertimePay'] = pd.to_numeric(df['OvertimePay'], errors='coerce').fillna(0)
(df['OvertimePay'] == 0).sum()

77325

Q8: Calculate the TotalPay for each JobTitle where totalpay > 300000

In [27]:
import pandas as pd
df = pd.read_csv('Salaries - Salaries.csv', low_memory=False)

df['TotalPay'] = pd.to_numeric(df['TotalPay'], errors='coerce')
df[df['TotalPay'] > 300000].groupby('JobTitle')['TotalPay'].sum()

JobTitle
ASSISTANT DEPUTY CHIEF II                          316285.74
Assistant Deputy Chief 2                           654066.15
Asst Chf of Dept (Fire Dept)                      1303828.26
Asst Med Examiner                                 1069837.40
BATTALION CHIEF, (FIRE DEPARTMENT)                 619408.60
Battalion Chief, Fire Suppress                    2845960.11
Battlion Chief, Fire Suppressi                    1266054.40
CAPTAIN III (POLICE DEPARTMENT)                    874189.19
CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)             302377.73
Captain 3                                         1274613.48
Captain, Fire Suppression                          610671.88
Chief Investment Officer                           339653.70
Chief of Police                                    987550.94
Chief, Fire Department                             977915.05
Commander 3                                        322143.10
DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)       326373.19
DEPUTY DIRECTOR OF INVESTMENTS                     307899.46
Dep Dir for Investments, Ret                       315572.01
Dept Head V                                        927825.30
Deputy Chief 3                                     471952.64
Deputy Sheriff                                     308434.84
EMT/Paramedic/Firefighter                          337204.86
Electronic Maintenance Tech                        336393.73
Executive Contract Employee                        623473.54
GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY     567595.43
Gen Mgr, Public Trnsp Dept                         305307.89
Lieutenant, Fire Suppression                       683220.45
Senior Physician Specialist                        634537.20
WIRE ROPE CABLE MAINTENANCE MECHANIC               332343.61
Name: TotalPay, dtype: float64

Q9: Find the top 5 JobTitles with the highest average TotalPayBenefits show in descending order

In [28]:
import pandas as pd
df = pd.read_csv('Salaries - Salaries.csv', low_memory=False)

df['TotalPayBenefits'] = pd.to_numeric(df['TotalPayBenefits'], errors='coerce')
df.groupby('JobTitle')['TotalPayBenefits'].mean().sort_values(ascending=False).head(5)

JobTitle
Chief Investment Officer                          436224.360000
Chief of Police                                   411732.266667
Chief, Fire Department                            408865.326667
GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY    399211.275000
Gen Mgr, Public Trnsp Dept                        380696.440000
Name: TotalPayBenefits, dtype: float64

Q10: Replace all missing Benefits values with 0

In [31]:
import pandas as pd
df = pd.read_csv('Salaries - Salaries.csv', low_memory=False)

df['Benefits'] = df['Benefits'].fillna(0)

df[['EmployeeName', 'Benefits']].head()   # SEE THE CHANGE!

        EmployeeName Benefits
0     NATHANIEL FORD        0
1       GARY JIMENEZ        0
2     ALBERT PARDINI        0
3  CHRISTOPHER CHONG        0
4    PATRICK GARDNER        0

Q11: Identify the top employee name by TotalPay in each Year. Show year, employeename and totalpay dataframe

In [35]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')
df = pd.read_csv('Salaries - Salaries.csv', low_memory=False)

df['TotalPay'] = df['TotalPay'].astype(float)
df.groupby('Year', group_keys=False).apply(lambda x: x.nlargest(1, 'TotalPay'))[['EmployeeName', 'TotalPay']]

          EmployeeName   TotalPay
0       NATHANIEL FORD  567595.43
36159   Gary Altenberg  362844.66
72927      Samson  Lai  347102.32
110531     David Shinn  471952.64

Q12: Find the number of employees per JobTitle.

In [36]:
import pandas as pd
df = pd.read_csv('Salaries - Salaries.csv', low_memory=False)

df['JobTitle'].value_counts()

JobTitle
Transit Operator                                  7036
Special Nurse                                     4389
Registered Nurse                                  3736
Public Svc Aide-Public Works                      2518
Police Officer 3                                  2421
                                                  ...
CHIEF HOUSING INSPECTOR                              1
TRAFFIC SIGNAL OPERATOR                              1
COURT COMPUTER FACILITIES COORDINATOR                1
AUTOMOTIVE BODY AND FENDER WORKER SUPERVISOR I       1
VICTIM & WITNESS TECHNICIAN                          1
Name: count, Length: 2159, dtype: int64